-- MySQL dump 10.13  Distrib 8.0.28, for Linux (x86_64)
--
-- Host: localhost    Database: cms
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Dumping data for table `alembic_version`
--

-- -- LOCK TABLES `alembic_version` WRITE;
-- /*!40000 ALTER TABLE `alembic_version` DISABLE KEYS */;
-- INSERT INTO `alembic_version` VALUES ('c9671d1dc74a');
-- /*!40000 ALTER TABLE `alembic_version` ENABLE KEYS */;
-- -- UNLOCK TABLES;

--
-- Dumping data for table `base_curriculum`
--

-- LOCK TABLES `base_curriculum` WRITE;
/*!40000 ALTER TABLE `base_curriculum` DISABLE KEYS */;
INSERT INTO `base_curriculum` VALUES (1,'图像处理','Photoshop','ps',NULL,'1','80',NULL,NULL,NULL,'考试','面授讲课',NULL,'1001'),(2,'电子商务基础',NULL,NULL,NULL,'2','70',NULL,NULL,NULL,'考试','面授讲课',NULL,'1002'),(3,'Dreamweaver网页设计',NULL,NULL,NULL,'1','80',NULL,NULL,NULL,'考查','面授讲课',NULL,'1003'),(4,'Access数据库应用技术',NULL,NULL,NULL,'2','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1004'),(5,'物联网综合实训',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考查','面授讲课',NULL,'1005'),(6,'计算机网络基础',NULL,NULL,NULL,'2','160',NULL,NULL,NULL,'考试','面授讲课',NULL,'1006'),(7,'网络攻防技术',NULL,NULL,NULL,'2','80',NULL,NULL,NULL,'考试','面授讲课',NULL,'1007'),(8,'python程序编写与入门',NULL,NULL,NULL,'1','80',NULL,NULL,NULL,'考查','面授讲课',NULL,'1008'),(9,'网络系统操作',NULL,NULL,NULL,'2','80',NULL,NULL,NULL,'考查','面授讲课',NULL,'1009'),(10,'网络服务配置管理',NULL,NULL,NULL,'2','80',NULL,NULL,NULL,'考查','面授讲课',NULL,'1010'),(11,'网络综合布线',NULL,NULL,NULL,'1','80',NULL,NULL,NULL,'考查','面授讲课',NULL,'1011'),(12,'计算机组装与维护',NULL,NULL,NULL,'2','120',NULL,NULL,NULL,'考查','面授讲课',NULL,'1012'),(13,'电工基础',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考查','面授讲课',NULL,'1013'),(14,'金融基础',NULL,NULL,NULL,'2','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1014'),(15,'会计基础',NULL,NULL,NULL,'2','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1015'),(16,'审计基础',NULL,NULL,NULL,'2','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1015'),(17,'出纳实务',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1016'),(18,'市场营销基础',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1017'),(19,'财经基本技能',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1017'),(20,'商品基础知识',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1018'),(21,'银行大堂服务实训',NULL,NULL,NULL,'1','120',NULL,NULL,NULL,'考试','面授讲课',NULL,'1019');
/*!40000 ALTER TABLE `base_curriculum` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `base_major`
--

-- LOCK TABLES `base_major` WRITE;
/*!40000 ALTER TABLE `base_major` DISABLE KEYS */;
INSERT INTO `base_major` VALUES (1,'1001','计算机','computer','计算机','五年制','计算机',NULL,NULL),(2,'1002','电子商务',NULL,NULL,'五年制',NULL,NULL,NULL),(3,'1003','会计',NULL,NULL,'五年制','金融方向',NULL,NULL);
/*!40000 ALTER TABLE `base_major` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `base_term`
--

-- LOCK TABLES `base_term` WRITE;
/*!40000 ALTER TABLE `base_term` DISABLE KEYS */;
INSERT INTO `base_term` VALUES (1,'2022A','2022',NULL,NULL,'2022学年');
/*!40000 ALTER TABLE `base_term` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `configuration`
--

-- LOCK TABLES `configuration` WRITE;
/*!40000 ALTER TABLE `configuration` DISABLE KEYS */;
INSERT INTO `configuration` VALUES (1,1,'xxx','0','localhost',16379,'','http://106.55.52.190:5000/tms/home','http://106.55.52.190:5000/tms/code_callback','http://106.55.52.190:5001/oauth2/authorization/authorize','http://106.55.52.190:5001/oauth2/authorization/token','http://106.55.52.190:5001/oauth2/resource/api/v1/user');
/*!40000 ALTER TABLE `configuration` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `grade_class`
--

-- LOCK TABLES `grade_class` WRITE;
/*!40000 ALTER TABLE `grade_class` DISABLE KEYS */;
INSERT INTO `grade_class` VALUES (1,NULL,NULL,2,0,2,NULL,1,2,1,1,'22级5年制计算机1班','22W计算机1',1,'第一学期'),(2,NULL,NULL,1,0,0,NULL,2,2,4,1,'22级5年制电子商务1班','22W电子商务1',NULL,NULL),(3,NULL,NULL,NULL,NULL,NULL,NULL,3,2,4,1,'22级W会计1班','22W会计1',NULL,NULL);
/*!40000 ALTER TABLE `grade_class` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `grade_grade`
--

-- LOCK TABLES `grade_grade` WRITE;
/*!40000 ALTER TABLE `grade_grade` DISABLE KEYS */;
INSERT INTO `grade_grade` VALUES (1,'2022',1,'2022','22级');
/*!40000 ALTER TABLE `grade_grade` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `plan_course`
--

-- LOCK TABLES `plan_course` WRITE;
/*!40000 ALTER TABLE `plan_course` DISABLE KEYS */;
INSERT INTO `plan_course` VALUES (1,1,1,'专业基础课','必修',1),(2,2,1,'专业基础课','必修',1),(3,3,1,'专业基础课','必修',1),(4,4,1,'专业基础课','必修',1),(5,5,1,'专业基础课','限选',1),(6,6,1,'专业基础课','必修',1),(7,7,1,'专业基础课','限选',1),(8,8,1,'专业基础课','限选',1),(9,9,1,'专业基础课','限选',1),(10,10,1,'专业课','限选',1),(11,11,0,'专业课','限选',1),(12,12,1,'专业基础课','限选',1),(13,13,0,'专业课','任选',1),(14,14,1,'专业基础课','必修',1),(15,15,1,'专业基础课','必修',1),(16,16,1,'专业基础课','必修',1),(17,18,0,'推荐选修课','限选',1),(18,17,0,'推荐选修课','限选',1),(19,19,0,'推荐选修课','限选',1),(20,20,0,'推荐选修课','限选',1),(21,21,0,'推荐选修课','限选',1);
/*!40000 ALTER TABLE `plan_course` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `plan_course_scheduling`
--

-- LOCK TABLES `plan_course_scheduling` WRITE;
/*!40000 ALTER TABLE `plan_course_scheduling` DISABLE KEYS */;
INSERT INTO `plan_course_scheduling` VALUES (1,1,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c101',NULL,'南海校区',NULL,NULL,NULL,2,2,NULL),(2,2,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c102',NULL,'南海校区',NULL,NULL,NULL,NULL,2,NULL),(3,3,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c103',NULL,'南海校区',NULL,NULL,NULL,2,2,NULL),(4,4,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c104',NULL,'石牌校区',NULL,NULL,NULL,2,2,NULL),(5,5,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','综合楼201',NULL,'石牌校区',NULL,NULL,NULL,NULL,2,NULL),(6,6,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','综合楼202',NULL,'石牌校区',NULL,NULL,NULL,2,2,NULL),(7,7,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','综合楼203',NULL,'石牌校区',NULL,NULL,NULL,NULL,2,NULL),(8,8,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','理1栋401',NULL,'大学城校区',NULL,NULL,NULL,NULL,NULL,NULL),(9,10,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','理1栋402',NULL,'大学城校区',NULL,NULL,NULL,NULL,2,NULL),(10,11,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','理1栋4013',NULL,'大学城校区',NULL,NULL,NULL,NULL,2,NULL),(11,12,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','理1栋4014',NULL,'大学城校区',NULL,NULL,NULL,NULL,2,NULL),(12,13,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}}','理1栋4015',NULL,'大学城校区',NULL,NULL,NULL,NULL,2,NULL),(13,14,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 1, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c301',NULL,'南海校区',NULL,NULL,NULL,2,2,NULL),(14,15,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 1, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c402',NULL,'南海校区',NULL,NULL,NULL,2,2,NULL),(15,16,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 1, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c401',NULL,'南海校区',NULL,NULL,NULL,2,1,NULL),(16,18,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c402',NULL,'南海校区',NULL,NULL,NULL,2,3,NULL),(17,19,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c402',NULL,'南海校区',NULL,NULL,NULL,2,1,NULL),(18,20,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 1}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c402',NULL,NULL,NULL,NULL,NULL,2,NULL,NULL),(19,21,1,'{\"\\u7b2c\\u4e00\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e8c\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e09\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 1, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u56db\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u4e94\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}, \"\\u7b2c\\u516d\\u8282\": {\"\\u5468\\u4e00\": 0, \"\\u5468\\u4e8c\": 0, \"\\u5468\\u4e09\": 0, \"\\u5468\\u56db\": 0, \"\\u5468\\u4e94\": 0}}','教c404',NULL,'南海校区',NULL,NULL,NULL,2,4,NULL);
/*!40000 ALTER TABLE `plan_course_scheduling` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `plan_course_scheduling_and_base_major`
--

-- LOCK TABLES `plan_course_scheduling_and_base_major` WRITE;
/*!40000 ALTER TABLE `plan_course_scheduling_and_base_major` DISABLE KEYS */;
INSERT INTO `plan_course_scheduling_and_base_major` VALUES (5,1),(6,1),(7,1),(8,1),(9,1),(10,1),(11,1),(12,1),(2,2),(13,3),(14,3),(15,3),(16,3),(17,3),(19,3);
/*!40000 ALTER TABLE `plan_course_scheduling_and_base_major` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `plan_course_scheduling_and_grade_class`
--

-- LOCK TABLES `plan_course_scheduling_and_grade_class` WRITE;
/*!40000 ALTER TABLE `plan_course_scheduling_and_grade_class` DISABLE KEYS */;
INSERT INTO `plan_course_scheduling_and_grade_class` VALUES (6,1),(7,1),(9,1),(11,1),(13,3),(14,3),(15,3);
/*!40000 ALTER TABLE `plan_course_scheduling_and_grade_class` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `plan_course_scheduling_and_grade_grade`
--

-- LOCK TABLES `plan_course_scheduling_and_grade_grade` WRITE;
/*!40000 ALTER TABLE `plan_course_scheduling_and_grade_grade` DISABLE KEYS */;
INSERT INTO `plan_course_scheduling_and_grade_grade` VALUES (1,1),(2,1),(4,1),(5,1),(6,1),(7,1),(8,1),(9,1),(10,1),(11,1),(13,1),(14,1),(15,1),(16,1);
/*!40000 ALTER TABLE `plan_course_scheduling_and_grade_grade` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `plan_teaching`
--

-- LOCK TABLES `plan_teaching` WRITE;
/*!40000 ALTER TABLE `plan_teaching` DISABLE KEYS */;
INSERT INTO `plan_teaching` VALUES (1,'2022年xxx职业技术学院计算机专业人才培养方案','1',1,NULL,NULL,NULL,NULL,'# 这是培养方案内容','[{\"课程类型\":\"必修\",\"课程名\":\"计算机网络基础\",\"学分\":\"2\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"必修\",\"课程名\":\"网络攻防技术\",\"学分\":\"2\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"必修\",\"课程名\":\"网络服务配置管理\",\"学分\":\"2\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"必修\",\"课程名\":\"计算机组装与维护\",\"学分\":\"2\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"选修\",\"课程名\":\"Dreamweaver网页设计\",\"学分\":\"1\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"选修\",\"课程名\":\"Access数据库应用技术\",\"学分\":\"1\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"选修\",\"课程名\":\"python程序编写与入门\",\"学分\":\"1\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"选修\",\"课程名\":\"网络综合布线\",\"学分\":\"1\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"},{\"课程类型\":\"选修\",\"课程名\":\"电工基础\",\"学分\":\"1\",\"第一学期\":\"40\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"}]','[{\"项\":\"学分\",\"第一学期\":\"10\",\"第二学期\":\"\",\"第三学期\":\"\",\"第四学期\":\"\",\"第五学期\":\"\",\"第六学期\":\"\",\"第七学期\":\"\",\"第八学期\":\"\",\"第九学期\":\"\",\"第十学期\":\"\"}]');
/*!40000 ALTER TABLE `plan_teaching` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `task_elective`
--

-- LOCK TABLES `task_elective` WRITE;
/*!40000 ALTER TABLE `task_elective` DISABLE KEYS */;
INSERT INTO `task_elective` VALUES (35,1,4,NULL,'通过','2022-03-05 18:44:18',NULL,NULL),(2672,1,1,NULL,'待审核','2022-04-13 10:26:34',NULL,NULL);
/*!40000 ALTER TABLE `task_elective` ENABLE KEYS */;
-- UNLOCK TABLES;

--
-- Dumping data for table `user`
--

-- LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,1,'20203712062','学生','陈锡',1),(2,2,'20203712168','教师','黄旭辉',NULL),(3,3,'20203712032','学生','郑新元',1),(4,4,'20203712105','学生','谢毅',3);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
-- UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-04-13  4:38:04
